Revit 2024 API
Family.CanHaveStructuralSection Method
 Identifies if this Family can have a structural section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool CanHaveStructuralSection()
Visual Basic
Public Function CanHaveStructuralSection As Boolean
Visual C++
public:
bool CanHaveStructuralSection()
Return Value
 True if the Family can have structural section, false otherwise.
See Also
Family Class
Autodesk.Revit.DB Namespace